package main




import "fmt"
import "github.com/whomm/a-bargain-hunting/util"
/*
//监控列表
var monitoringtargets = [...][]string{
	{"浦发银行", "sh600000"},
	{"民生银行", "sh600016"},
	{"中国石化", "sh600028"},
	{"南方航空", "sh600029"},
	{"中信证券", "sh600030"},
	{"招商银行", "sh600036"},
	{"保利地产", "sh600048"},
	{"中国联通", "sh600050"},
	{"同方股份", "sh600100"},
	{"上汽集团", "sh600104"},
	{"北方稀土", "sh600111"},
	{"华夏幸福", "sh600340"},
	{"信威集团", "sh600485"},
	{"康美药业", "sh600518"},
	{"贵州茅台", "sh600519"},
	{"山东黄金", "sh600547"},
	{"绿地控股", "sh600606"},
	{"海通证券", "sh600837"},
	{"伊利股份", "sh600887"},
	{"江苏银行", "sh600919"},
	{"东方证券", "sh600958"},
	{"招商证券", "sh600999"},
	{"大秦铁路", "sh601006"},
	{"中国神华", "sh601088"},
	{"兴业银行", "sh601166"},
	{"北京银行", "sh601169"},
	{"中国铁建", "sh601186"},
	{"东兴证券", "sh601198"},
	{"国泰君安", "sh601211"},
	{"上海银行", "sh601229"},
	{"农业银行", "sh601288"},
	{"中国平安", "sh601318"},
	{"交通银行", "sh601328"},
	{"新华保险", "sh601336"},
	{"中国中铁", "sh601390"},
	{"工商银行", "sh601398"},
	{"中国太保", "sh601601"},
	{"中国人寿", "sh601628"},
	{"中国建筑", "sh601668"},
	{"华泰证券", "sh601688"},
	{"中国中车", "sh601766"},
	{"光大证券", "sh601788"},
	{"中国交建", "sh601800"},
	{"光大银行", "sh601818"},
	{"中国石油", "sh601857"},
	{"中国银河", "sh601881"},
	{"方正证券", "sh601901"},
	{"中国核电", "sh601985"},
	{"中国银行", "sh601988"},
	{"中国重工", "sh601989"},
}
*/


func main(){
	xp,_:=util.Get_k_daily("sh601989")
	for _,v := range xp {
		fmt.Println(v.Date, v.High,)
	}
	g,_ := util.Get_real_time_data("sh601989")
	fmt.Print(g.Stockname,g.Now, g.Date, g.Time)
	
	
}